Repository: Eslam-78/MyTODO_App
Catalog: lib/l10n/intl_*.arb
Languages: ar

# lightTheme
source: Light
ar: فاتح

# darkTheme
source: Dark
ar: داكن

# systemTheme
source: System
ar: تلقائي

# homePage
source: Home
ar: الصفحة الرئيسية

source: Nearby Tasks
ar: المهام القريبة

source: View All
ar: عرض الكل

source: Search tasks...
ar: ابحث عن المهام...

source: Current Tasks
ar: المهام الحالية

source: Good Morning
ar: صباح الخير

source: Good Evening
ar: مساء الخير

source: Completed
ar: المكتملة

source: Remaining
ar: المتبقية

source: Streak
ar: المتتالية

source: Days
ar: أيام

# turnChecked
source: Task marked as completed
ar: تم تفعيل المهمة كمكتملة

# turnUnchecked
source: Task marked as incomplete
ar: تم إلغاء تفعيل المهمة كمكتملة

source: Weekly Tasks
ar: المهام الأسبوعية

# thisWeekStats
source: This Week
ar: هذا الأسبوع

source: Your Progress
ar: تقدمك

source: Task Categories
ar: تصنيفات المهام

source: Task Status
ar: حالة المهمة

source: Your Tasks
ar: المهام الخاصة بك

source: Achievements
ar: الإنجازات

source: All
ar: الكل

source: Incomplete
ar: غير المكتملة

# noIncompleteBadges
source: No incomplete badges available
ar: لا توجد شارات غير مكتملة متاحة حالياً

source: Level
ar: المستوى

source: Current Streak
ar: الأيام المتتالية

source: Best Streak
ar: أفضل تتابع

source: Locked Badge
ar: شارة مقفلة

# congratsBadge
source: Congratulations! You earned this badge! With XP:
ar: مبروك! لقد حصلت على هذه الشارة! مع الاكس بي:

# unlockRequirement
source: Complete requirements to unlock
ar: نفذ المتطلب لفتح هذه الشارة

# unlockConditions
source: Unlock Requirements:
ar: متطلبات الفتح:

source: Required Level:
ar: المستوى المطلوب:

source: Okay
ar: حسناً

# completeTasksPrompt
source: Complete tasks to unlock new achievements!
ar: أكمل المهام لفتح الإنجازات الجديدة!

# noAchievements
source: No achievements yet
ar: لا توجد إنجازات بعد

source: Opened
ar: مفتوحة

source: Closed
ar: مغلقة

source: Settings
ar: الإعدادات

source: Arabic
ar: العربية

source: English
ar: الإنجليزية

source: Profile Settings
ar: إعدادات الملف الشخصي

source: Edit Profile
ar: تعديل الملف الشخصي

source: Reminder Time
ar: وقت التذكير

source: App Settings
ar: إعدادات التطبيق

source: Theme Mode
ar: وضع السمة

source: Language
ar: اللغة

source: Daily Reminders
ar: التذكيرات اليومية

# appInfo
source: App Information
ar: معلومات التطبيق

source: Version
ar: الإصدار

source: Built with
ar: بنظام

source: Privacy Policy
ar: سياسة الخصوصية

source: Terms of Use
ar: شروط الاستخدام

source: Press to view
ar: اضغط لعرض

source: Reset App
ar: إعادة تعيين التطبيق

# resetConfirmation
source: Are you sure you want to reset all settings and data?
ar: هل أنت متأكد من إعادة تعيين جميع الإعدادات والبيانات؟

source: Cancel
ar: إلغاء

# resetSuccess
source: Reset successfully completed
ar: تم إعادة التعيين بنجاح

source: Confirm
ar: تأكيد

source: Focus Mode
ar: وضع التركيز

source: Focus Settings
ar: إعدادات التركيز

# focusDuration
source: Focus Duration (minutes)
ar: مدة التركيز (دقائق)

# shortBreak
source: Short Break (minutes)
ar: استراحة قصيرة (دقائق)

# longBreak
source: Long Break (minutes)
ar: استراحة طويلة (دقائق)

source: Save
ar: حفظ

source: End Focus Mode
ar: إنهاء وضع التركيز

source: Completed Sessions
ar: الجلسات المكتملة

source: Total Sessions
ar: إجمالي الجلسات

source: Minutes
ar: دقائق

# startConfirm
source: Ready To Start
ar: مستعد للبدء

# runTimeProgress
source: Running Time
ar: جاري العمل...

# breakTimeProgress
source: Break Time
ar: جاري الاستراحة...

# focusDurationTime
source: Focus Duration:
ar: وضع التركيز:

# shortBreakTime
source: Short Break
ar: الإستراحة القصيرة

# longBreakTime
source: Long Break
ar: الإستراحة الطويلة

source: Tasks Management
ar: إدارة المهام

source: Add New Task
ar: إضافة مهمة جديدة

source: Task Title
ar: عنوان المهمة

# taskDescription
source: Task Description (optional)
ar: وصف المهمة (اختياري)

source: Add
ar: إضافة

source: Update
ar: تحديث

# taskUpdated
source: Task updated successfully
ar: تم تحديث المهمة بنجاح

# taskAdded
source: Task added successfully
ar: تم إضافة المهمة بنجاح

source: No tasks found!
ar: لم يتم عثور على المهام!

source: Pending
ar: قيد الانتظار

# priority
source: Priority Level
ar: مستوى الأولوية

source: Select Due Date
ar: حدد تاريخ الاستحقاق

# pleaseSelectDueDate
source: Please select a due date
ar: يرجى تحديد تاريخ الاستحقاق

# pleaseSelectPriority
source: Please select a priority level
ar: يرجى تحديد مستوى الأولوية

# pleaseEnterTitle
source: Please enter a task title
ar: يرجى إدخال عنوان المهمة

source: Category
ar: الفئة

source: Select Category
ar: اختر فئة

source: Task Details
ar: تفاصيل المهمة

source: Description:
ar: الوصف:

source: In Progress
ar: قيد التنفيذ

# dateInfo
source: Date Information:
ar: معلومات التاريخ:

source: Created Date:
ar: تاريخ الإنشاء:

source: Due Date:
ar: تاريخ الاستحقاق:

source: Completed Date:
ar: تاريخ الإكمال:

source: Edit Task
ar: تعديل المهمة

# markComplete
source: Mark as Complete
ar: تمييز كمكتملة

source: Reopen
ar: إعادة الفتح

source: Task reopened
ar: تم إعادة فتح المهمة

# taskCompleted
source: Task completed successfully
ar: تم إكمال المهمة بنجاح

source: Delete Task
ar: حذف المهمة

# deleteConfirmation
source: Are you sure you want to delete this task?
ar: هل أنت متأكد من حذف هذه المهمة؟

# taskDeleted
source: Task deleted successfully
ar: تم حذف المهمة بنجاح

source: Delete
ar: حذف

# taskTitleLabel
source: Task
ar: المهمة

# taskStatusLabel
source: Status
ar: حالة المهمة

# taskPriorityLabel
source: Priority
ar: أولوية المهمة

source: Task Suggestions
ar: اقتراحات المهام

# noSuggestionsAvailable
source: No suggestions available for this task
ar: لا توجد اقتراحات متاحة لهذه المهمة

source: Related Tasks
ar: مهام مرتبطة

source: Sub Tasks
ar: مهام فرعية

source: Page Not Found
ar: الصفحة غير موجودة

# pageNotFoundMessage
source: Sorry, the requested page could not be found.
ar: عذرًا، لا يمكن العثور على الصفحة المطلوبة.

source: Go Back
ar: العودة

# navHome
source: Home
ar: الرئيسية

# navAchievments
source: Trofies
ar: الإنجازات

# navFocusMode
source: Focus Mode
ar: التركيز

# navSettings
source: Settings
ar: الإعدادات

# priorityNone
source: None
ar: لا يوجد

# priorityLow
source: Low
ar: منخفض

# priorityMedium
source: Medium
ar: متوسط

# priorityHigh
source: High
ar: عالي

# priorityUrgent
source: Urgent
ar: عاجل

# repeatWeeklyLabel
source: Repeat weekly on day
ar: تكرار أسبوعي في يوم

# repeatHint
source: Select repeat day (optional)
ar: اختر يوم التكرار (اختياري)

source: Monday
ar: الإثنين

source: Tuesday
ar: الثلاثاء

source: Wednesday
ar: الأربعاء

source: Thursday
ar: الخميس

source: Friday
ar: الجمعة

source: Saturday
ar: السبت

source: Sunday
ar: الأحد

# badge_1_name
source: The Beginning
ar: البدايات

# badge_1_description
source: Complete your first task
ar: أكمل أول مهمة لك

# badge_2_name
source: Early Riser
ar: المستيقظ المبكر

# badge_2_description
source: Complete a task before 9 AM
ar: أكمل مهمة قبل الساعة 9 صباحًا

# badge_3_name
source: Organizer
ar: المنظم

# badge_3_description
source: Reach level 5 in the task app
ar: اوصل الى المستوى 5 في تطبيق المهام

# badge_4_name
source: Streak Starter
ar: المتسلسل

# badge_4_description
source: Complete tasks two days in a row
ar: أنجز مهامًا ليومين متتاليين

# badge_5_name
source: Digital Cleaner
ar: المنظف الرقمي

# badge_5_description
source: Delete 3 old completed tasks
ar: احذف 3 مهام منتهية قديمة

# badge_6_name
source: Committed
ar: الملتزم

# badge_6_description
source: Complete a task daily for 5 days
ar: أنجز مهمة يوميًا لمدة 5 أيام

# badge_7_name
source: All Done
ar: مكتمل

# badge_7_description
source: Complete all your tasks in one day
ar: أكمل كل مهامك في يوم

# badge_8_name
source: Planner
ar: المخطط

# badge_8_description
source: Add 10 new tasks in a week
ar: أضف 10 مهام جديدة في أسبوع

# badge_9_name
source: Focused
ar: المركز

# badge_9_description
source: Use focus mode 3 times
ar: استخدم وضع التركيز 3 مرات

# badge_10_name
source: Leader
ar: القائد

# badge_10_description
source: Reach level 10 in the task app
ar: اوصل الى المستوى 10 في تطبيق المهام

# badge_11_name
source: Ten in a Day
ar: العشاري

# badge_11_description
source: Complete 10 tasks in one day
ar: أنجز 10 مهام في يوم

# badge_12_name
source: No Breaks
ar: بلا انقطاع

# badge_12_description
source: Complete tasks for 7 consecutive days
ar: أنجز 7 أيام متواصلة

# badge_13_name
source: Resilient
ar: المقاوم

# badge_13_description
source: Reach level 20 in the task app
ar: اوصل الى المستوى 20 في تطبيق المهام

# badge_14_name
source: The Flame
ar: الشُعلة

# badge_14_description
source: Maintain a 14-day streak
ar: حافظ على streak 14 يوم

# badge_15_name
source: Time Master
ar: متقن الوقت

# badge_15_description
source: Complete a task on time
ar: أنجز مهمة بالتوقيت المحدد

# badge_16_name
source: The Master
ar: المتقن

# badge_16_description
source: Complete 100 tasks
ar: أكمل 100 مهمة

# badge_17_name
source: Yearly Planner
ar: المخطط السنوي

# badge_17_description
source: Reach level 40 in the task app
ar: اوصل الى مستوى 40 في تطبيق المهام

# badge_18_name
source: Balanced
ar: المتزن

# badge_18_description
source: Complete diverse tasks in one day
ar: أكمل مهام متنوعة في يوم

# badge_19_name
source: The Legend
ar: الأسطورة

# badge_19_description
source: Complete all your tasks 7 days in a row
ar: أكمل كل مهامك 7 أيام متتالية

# badge_20_name
source: Golden Legend
ar: الأسطورة الذهبية

# badge_20_description
source: Earn 10,000 XP
ar: اجمع 10000 XP

# badge_21_name
source: Pro
ar: محترف

# badge_21_description
source: Reach level 50 in the task app
ar: اوصل الى مستوى 50 في تطبيق المهام

# morning_suggestion_title
source: Morning Suggestion
ar: اقتراح صباحي

# morning_suggestion_body
source: You have {count} high priority tasks for this morning! 🌅
ar: لديك {count} مهام عالية الأولوية لهذا الصباح! 🌅

# smart_tracking_title
source: Smart Tracking
ar: تتبع الذكي

# reminder_title
source: Reminder
ar: تذكير

# low_productivity_body
source: You can do better! Try focusing on one task 🚀
ar: انت تستطيع أكثر! حاول تركيزك على مهمة واحدة 🚀

# congrats_title
source: Congratulations!
ar: تهانينا!

# high_productivity_body
source: Amazing! You've completed most of your tasks today! 🎉
ar: مذهل! لقد أنجزت معظم مهامك اليوم! 🎉

# alert_title
source: Alert
ar: تنبيه

# critical_tasks_body
source: Attention! {count} tasks are due soon ⏰
ar: انتبه! {count} مهام قد تفوت موعدها قريباً ⏰

# focus_mode_title
source: Focus Mode
ar: وضع التركيز

# focus_mode_active_body
source: Focus mode is active! Time to get things done 💪
ar: وضع التركيز مفعل! حان وقت الإنجاز 💪

# focus_suggestion_body
source: You can activate focus mode to improve your productivity 📵
ar: يمكنك تفعيل وضع التركيز لتحسين إنتاجيتك 📵

# daily_recommendations_title
source: Daily Recommendations
ar: توصيات اليوم

# recurring_tasks_body
source: Today is {dayName}. You have: {count} recurring tasks 🔄
ar: اليوم هو {dayName}. لديك: {count} مهام متكررة 🔄

# add_recurring_reminder
source: Don't forget to add your recurring tasks for today! 📅
ar: لا تنسى إضافة مهامك المتكررة لهذا اليوم! 📅

# no_tasks_body
source: No tasks yet! 🤔
ar: لا توجد مهام حتى الان! 🤔

# activeNotification
source: Enable Notifications
ar: تفعيل الإشعارات

# notificationToggleSuccess
source: Notifications {status} successfully
ar: تم {status} الإشعارات بنجاح

# notificationEnabled
source: enabled
ar: تفعيل

# notificationDisabled
source: disabled
ar: تعطيل

# vibrationSettings
source: Notification Vibration
ar: اهتزاز الإشعارات

# vibrationToggleSuccess
source: Notification vibration {status} successfully
ar: تم {status} اهتزاز الإشعارات بنجاح

# vibrationEnabled
source: enabled
ar: تفعيل

# vibrationDisabled
source: disabled
ar: تعطيل

# notificationPermissionWarning
source: Permission required to enable notifications
ar: الصلاحية مطلوبة لتفعيل الإشعارات

# grantNotificationAccessDescription
source: Notification permission is required to receive alerts
ar: يجب منح صلاحية الإشعارات لتلقي التنبيهات

# notificationPermissionRequired
source: Notification permission is required to use this feature
ar: يجب منح صلاحية الإشعارات لاستخدام هذه الميزة

# geoHomeMessage
source: 🌙 Time to review your evening tasks at home!
ar: 🌙 حان وقت مراجعة مهام المساء في المنزل!

# geoWorkMessage
source: 🧑‍💻 Don’t forget to organize your work tasks now.
ar: 🧑‍💻 لا تنسَ تنظيم مهام العمل الآن.

# geoGymMessage
source: 🏋️‍♂️ Reminder for health and fitness tasks!
ar: 🏋️‍♂️ تذكير بمهام اللياقة والصحة!

source: Work
ar: العمل

source: Personal
ar: شخصية

source: Shopping
ar: تسوق

source: Fitness
ar: لياقة

source: Study
ar: دراسة

source: Health
ar: صحة

source: Finance
ar: مالية
